{
    "url": "daverichardson.ca",
    "email_address": "contactme@daverichardson.ca",
    "name": "dave.richardson",
    "firstname": "dave",
    "lastname": "richardson",
    "title": "full stack developer", 
    "navigation": {
        "about": "About",
        "discover": "Discover",        
        "blog": "Blog",
        "photos": "Photos",
        "contact": "Contact",
        "github": "My open source work",
        "previous": "Back",
        "next": "Next"
    },   
    "pages": {
        "pgp":{
            "title": "wanna talk securely?",
            "subtitle": "Feel free to use my PGP key when emailing me..."
        },
        "about": {
            "title": "a lover of tech",
            "info": "<p>Hi, I&#8217;m a full stack software developer in <em>Winnipeg, MB<\/em> and I <em>really<\/em> like technology.<\/p>\n\n<h4><\/h4>\n\n<p>I enjoy everything from front end web and mobile development with <strong>React</strong> and <strong>React Native</strong>, to backend API's running <strong>Rails</strong>, <strong>ExpressJS</strong>. I have experience with a variety of software stacks, and am enjoying playing with cloud solutions like <strong>Google Cloud Platform</strong> and <strong>Firebase</strong>. Over the years I have developed a deep passion for software development and have applied myself in both theoretical and practical applications.<\/p>\n\n<h4><\/h4>\n\n<h3>I have a passion for life, learning, and technology.<\/h3>\n\n<p><\/p>\n"
        },
        "discover": {
            "title": "a lover of exploration",
            "subtitle": "I believe in research & discovery",
            "experience": "Places I have worked",
            "intro": "I don't just write code, I aim to write accessible code. Software development is my never ending journey. Therefore, I advocate for clean code, agile development, and innovative technologies to provide a modern, fast, and accessible product.",
            "summary": "I don't wait for the future. I make it. Swipe left to learn more about where I have worked and what I do.",
            "jobs": {
                "legible": {
                    "title": "legible media inc.",
                    "position": "Senior Software Developer",
                    "visit": "Visit Legible",
                    "description": "I am currently doing really cool things on the backend at Legible."
                },
                "transit": {
                    "title": "winnipeg transit",
                    "position": "Programmer Analyst II",
                    "visit": "Visit Winnipeg Transit",
                    "description": "Many people in the world rely on public transit.<br /><br />At <strong>Winnipeg Transit<\/strong>, my focus is on making schedule information accessible through a variety of tools available to the public.<br /><br />I function as a programmer / analyst on the <strong>Public Facing Apps</strong> team.  I have a strong passion for emerging technologies, so I enjoy learning and testing new tools with my team."
                },
                "dawei": {
                    "title": "dawei info. solutions",
                    "position": "Owner, Lead Developer",
                    "description": "Why not do what you love?<br /><br /><strong>Dawei Information Solutions</strong> made having a web presence easy for everyone.<br /><br />I started <strong>Dawei Information Solutions</strong> to help reduce the entry barrier for small to medium sized businesses and provide an easy, cost effective way to have websites and general IT support.<br /><br />I've moved on from <strong>Dawei</strong> recently, and am now working full-time at <strong>Winnipeg Transit</strong>"
                },
                "enigma": {
                    "title": "enigma networks",
                    "position": "Lead Software Developer",
                    "description": "I love working with small businesses.<br /><br /><strong>Enigma Networks</strong> was a small IT shop in Winnipeg that provided small businesses with IT services such as custom web based software applications.<br /><br />I started using PHP to develop and deploy production ready solutions for a variety of projects from online stores, to reservation and inventory management systems for local businesses.<br /><br />This is where I started to delve into the vast world of NodeJS and Angular."
                }
            }            
        },
        "blog": {
            "title": "a lover of sharing",
            "coming soon": "coming soon...",
            "link_text":  "read more"
        },
        "contact": {
            "title": "a lover of communication",
            "subtitle": "So you'd like to get in touch.",
            "intro": "To save us both time, I've put together a brief guide to help you find the best methods to contact me.",
            "email": "You should contact me by email if:",
            "social": "You should contact me by social media if:",
            "consult": "You'd like me to consult on a project with you",
            "history": "You'd like a more detailed career history or have other business questions",
            "feedback": "You have any other feedback related to this site",
            "send_an_email": "If this fits your enquiry, send an email to",
            "say_hello": "You want to say hello",
            "know_more_about_me": "You want to know more about me",
            "any_other_reason": "Any other reason",
            "find_me_as": "Find me everywhere as",
            "feel_free_to_use": "Feel free to use my ",
            "if_you_want": ", if you're into that sort of thing..."
        },
        "photos": {
            "title": "a lover of art"
        }
    },
    "notifications": {
        "contact": "Looking to get in touch?",
        "contact_button": "Contact Me"
    }    
}